# coding=utf-8
from kg.lang.lang import KyrgyzWord
from kg.lang.syn._syz import SyzZatMuchosu
from kg.tests import KGTestCase


class ZatSyzMuchoTest(KGTestCase):
    def test_1(self):
        data = self.get_data()

        for word, expected_form in data.items():
            affix = SyzZatMuchosu(KyrgyzWord(word))
            self.assertEqual(affix.make(), expected_form)

    def get_data(self):
        return {
            u'ноябрь': u'ноябрсыз',
            u'семинар': u'семинарсыз',
            u'толуктооч': u'толуктоочсуз',
            u'куррикулум': u'куррикулумсуз',
            u'калп': u'калпсыз',
            u'алпкаракуш': u'алпкаракушсуз',
            u'чок': u'чоксуз',
            u'керек': u'керексиз',
            u'номер': u'номерсиз',
            u'өмүрзар': u'өмүрзарсыз',
            u'зарылчылык': u'зарылчылыксыз',
            u'айдоочу': u'айдоочусуз',
            u'диабет': u'диабетсиз',
            u'конфедерация': u'конфедерациясыз',
            u'зоолог': u'зоологсуз',
            u'жөлөк': u'жөлөксүз',
            u'чаарчык': u'чаарчыксыз',
            u'диагнос': u'диагноссуз',
            u'жүк': u'жүксүз',
            u'келте': u'келтесиз',
            u'абийир': u'абийирсиз',
            u'код': u'кодсуз',
            u'айыл-апа': u'айыл-апасыз',
            u'козголоң': u'козголоңсуз',
            u'табит': u'табитсиз',
            u'вектор': u'векторсуз',
            u'табуучу': u'табуучусуз',
            u'фармацевт': u'фармацевтсиз',
            u'авиабомбалоо': u'авиабомбалоосуз',
            u'даткайым': u'даткайымсыз',
            u'ымала': u'ымаласыз',
            u'пакене': u'пакенесиз',
            u'пальто': u'пальтосуз',
            u'убакыт': u'убакытсыз',
            u'жеңил өнөр жай': u'жеңил өнөр жайсыз',
            u'түндүк': u'түндүксүз',
            u'буддист': u'буддистсиз',
            u'басма': u'басмасыз',
            u'керектөөчүлүк': u'керектөөчүлүксүз',
            u'ранг': u'рангсыз',
            u'ордер': u'ордерсиз',
            u'тамак-аш': u'тамак-ашсыз',
            u'жесир': u'жесирсиз',
            u'паста': u'пастасыз',
            u'кошомат': u'кошоматсыз',
            u'түшүнүк кат': u'түшүнүк катсыз',
            u'кара кулак шер': u'кара кулак шерсиз',
            u'таңсык': u'таңсыксыз',
            u'сур эчки': u'сур эчкисиз',
            u'нерсе': u'нерсесиз',
        }
