from kg.lang.etish.chak import UchurChak
from kg.lang.helps.attrs import *
from kg.lang.lang import KyrgyzWord
from kg.tests import KGTestCase


attrs_list = [men, sen, al, biz, siler, alar, siz, sizder]


class UchurChakTest(KGTestCase):
    def test_1(self):
        data = self.get_data()

        for word, forms in data.items():
            chak = UchurChak(KyrgyzWord(word))
            for i in range(len(attrs_list)):
                attrs = attrs_list[i]
                self.assertEqual(chak.make(attrs.jak, attrs.jeke, attrs.sylyk), forms[i])

    def get_data(self):
        return {
            'кыл': [
                'кылып жатам', 'кылып жатасың', 'кылып жатат',
                'кылып жатабыз', 'кылып жатасыңар', 'кылып жатышат',
                'кылып жатасыз', 'кылып жатасыздар'],

            'тап': [
                'таап жатам', 'таап жатасың', 'таап жатат',
                'таап жатабыз', 'таап жатасыңар', 'таап жатышат',
                'таап жатасыз', 'таап жатасыздар'],

            'жаса': [
                'жасап жатам', 'жасап жатасың', 'жасап жатат',
                'жасап жатабыз', 'жасап жатасыңар', 'жасап жатышат',
                'жасап жатасыз', 'жасап жатасыздар'],

            'ташы': [
                'ташып жатам', 'ташып жатасың', 'ташып жатат',
                'ташып жатабыз', 'ташып жатасыңар', 'ташып жатышат',
                'ташып жатасыз', 'ташып жатасыздар'],

            'ук': [
                'угуп жатам', 'угуп жатасың', 'угуп жатат',
                'угуп жатабыз', 'угуп жатасыңар', 'угуп жатышат',
                'угуп жатасыз', 'угуп жатасыздар'],

            'чой': [
                'чоюп жатам', 'чоюп жатасың', 'чоюп жатат',
                'чоюп жатабыз', 'чоюп жатасыңар', 'чоюп жатышат',
                'чоюп жатасыз', 'чоюп жатасыздар'],

            'ал': [
                'алып жатам', 'алып жатасың', 'алып жатат',
                'алып жатабыз', 'алып жатасыңар', 'алып жатышат',
                'алып жатасыз', 'алып жатасыздар'],

            'бар': [
                'барып жатам', 'барып жатасың', 'барып жатат',
                'барып жатабыз', 'барып жатасыңар', 'барып жатышат',
                'барып жатасыз', 'барып жатасыздар'],

            'ич': [
                'ичип жатам', 'ичип жатасың', 'ичип жатат',
                'ичип жатабыз', 'ичип жатасыңар', 'ичип жатышат',
                'ичип жатасыз', 'ичип жатасыздар'],

            'каз': [
                'казып жатам', 'казып жатасың', 'казып жатат',
                'казып жатабыз', 'казып жатасыңар', 'казып жатышат',
                'казып жатасыз', 'казып жатасыздар'],

            'кара': [
                'карап жатам', 'карап жатасың', 'карап жатат',
                'карап жатабыз', 'карап жатасыңар', 'карап жатышат',
                'карап жатасыз', 'карап жатасыздар'],

            'кий': [
                'кийип жатам', 'кийип жатасың', 'кийип жатат',
                'кийип жатабыз', 'кийип жатасыңар', 'кийип жатышат',
                'кийип жатасыз', 'кийип жатасыздар'],

            'сай': [
                'сайып жатам', 'сайып жатасың', 'сайып жатат',
                'сайып жатабыз', 'сайып жатасыңар', 'сайып жатышат',
                'сайып жатасыз', 'сайып жатасыздар'],

            'теп': [
                'тээп жатам', 'тээп жатасың', 'тээп жатат',
                'тээп жатабыз', 'тээп жатасыңар', 'тээп жатышат',
                'тээп жатасыз', 'тээп жатасыздар'],

            'токто': [
                'токтоп жатам', 'токтоп жатасың', 'токтоп жатат',
                'токтоп жатабыз', 'токтоп жатасыңар', 'токтоп жатышат',
                'токтоп жатасыз', 'токтоп жатасыздар'],
            'алай': [
                'алайып жатам', 'алайып жатасың', 'алайып жатат',
                'алайып жатабыз', 'алайып жатасыңар', 'алайып жатышат',
                'алайып жатасыз', 'алайып жатасыздар'],

            'куй': [
                'куюп жатам', 'куюп жатасың', 'куюп жатат',
                'куюп жатабыз', 'куюп жатасыңар', 'куюп жатышат',
                'куюп жатасыз', 'куюп жатасыздар'],

            'бойтой': [
                'бойтоюп жатам', 'бойтоюп жатасың', 'бойтоюп жатат',
                'бойтоюп жатабыз', 'бойтоюп жатасыңар', 'бойтоюп жатышат',
                'бойтоюп жатасыз', 'бойтоюп жатасыздар'],

            'былчый': [
                'былчыйып жатам', 'былчыйып жатасың', 'былчыйып жатат',
                'былчыйып жатабыз', 'былчыйып жатасыңар', 'былчыйып жатышат',
                'былчыйып жатасыз', 'былчыйып жатасыздар'],

            'кеңей': [
                'кеңейип жатам', 'кеңейип жатасың', 'кеңейип жатат',
                'кеңейип жатабыз', 'кеңейип жатасыңар', 'кеңейип жатышат',
                'кеңейип жатасыз', 'кеңейип жатасыздар'],

            'буруй': [
                'буруюп жатам', 'буруюп жатасың', 'буруюп жатат',
                'буруюп жатабыз', 'буруюп жатасыңар', 'буруюп жатышат',
                'буруюп жатасыз', 'буруюп жатасыздар'],

            'ой': [
                'оюп жатам', 'оюп жатасың', 'оюп жатат',
                'оюп жатабыз', 'оюп жатасыңар', 'оюп жатышат',
                'оюп жатасыз', 'оюп жатасыздар'],

            'акшый': [
                'акшыйып жатам', 'акшыйып жатасың', 'акшыйып жатат',
                'акшыйып жатабыз', 'акшыйып жатасыңар', 'акшыйып жатышат',
                'акшыйып жатасыз', 'акшыйып жатасыздар'],

            'төмпөй': [
                'төмпөйүп жатам', 'төмпөйүп жатасың', 'төмпөйүп жатат',
                'төмпөйүп жатабыз', 'төмпөйүп жатасыңар', 'төмпөйүп жатышат',
                'төмпөйүп жатасыз', 'төмпөйүп жатасыздар'],

        }
