from kg.lang.helps.attrs import *
from kg.lang.lang import KyrgyzWord
from kg.lang.taandyk import Taandyk
from kg.tests import KGTestCase


attrs_list = [men, sen, al, biz, siler, alar, siz, sizder]


class TaandykTest(KGTestCase):
    def test_1(self):
        data = self.get_data()

        for word, forms in data.items():
            taandyk = Taandyk(KyrgyzWord(word))
            for i in range(len(attrs_list)):
                attrs = attrs_list[i]
                self.assertEqual(taandyk.make(attrs.jak, attrs.jeke, attrs.sylyk).word, forms[i])

    def get_data(self):
        return {
            'кий': [
                'кийим', 'кийиң', 'кийи',
                'кийибиз', 'кийиңер', 'кийи',
                'кийиңиз', 'кийиңиздер'],

            'таш': [
                'ташым', 'ташың', 'ташы',
                'ташыбыз', 'ташыңар', 'ташы',
                'ташыңыз', 'ташыңыздар'],

            'кыл': [
                'кылым', 'кылың', 'кылы',
                'кылыбыз', 'кылыңар', 'кылы',
                'кылыңыз', 'кылыңыздар'],

            'каз': [
                'казым', 'казың', 'казы',
                'казыбыз', 'казыңар', 'казы',
                'казыңыз', 'казыңыздар'],

            'сай': [
                'сайым', 'сайың', 'сайы',
                'сайыбыз', 'сайыңар', 'сайы',
                'сайыңыз', 'сайыңыздар'],

            'ич': [
                'ичим', 'ичиң', 'ичи',
                'ичибиз', 'ичиңер', 'ичи',
                'ичиңиз', 'ичиңиздер'],

            'токтом': [
                'токтомум', 'токтомуң', 'токтому',
                'токтомубуз', 'токтомуңар', 'токтому',
                'токтомуңуз', 'токтомуңуздар'],

            'ой': [
                'ойум', 'ойуң', 'ойу',
                'ойубуз', 'ойуңар', 'ойу',
                'ойуңуз', 'ойуңуздар'],

            'бала': [
                'балам', 'балаң', 'баласы',
                'балабыз', 'балаңар', 'баласы',
                'балаңыз', 'балаңыздар'],

            'көл': [
                'көлүм', 'көлүң', 'көлү',
                'көлүбүз', 'көлүңөр', 'көлү',
                'көлүңүз', 'көлүңүздөр'],

        }
