# coding=utf-8
from kg.lang.etish._ba import BaEtishMuchosu
from kg.lang.etish._chu import ChuEtishMuchosu
from kg.lang.etish._chuday import ChudayEtishMuchosu
from kg.lang.lang import KyrgyzWord
from kg.tests import KGTestCase


class EtishChudayMuchoTest(KGTestCase):
    def test_1(self):
        data = self.get_data()

        for word, expected_form in data.items():
            affix = ChudayEtishMuchosu(KyrgyzWord(word))
            self.assertEqual(affix.make(), expected_form)

    def get_data(self):
        return {
            u'апкаары': u'апкаарычудай',
            u'мейманчыла': u'мейманчылачудай',
            u'какыра': u'какырачудай',
            u'укумда': u'укумдачудай',
            u'баардаш': u'баардашчудай',
            u'жокто': u'жокточудай',
            u'жаңылыш': u'жаңылышчудай',
            u'жадырап-жайна': u'жадырап-жайначудай',
            u'боозу': u'боозучудай',
            u'ур': u'урчудай',
            u'токто': u'токточудай',
            u'кыйкый': u'кыйкыйчудай',
            u'алай': u'алайчудай',
            u'жактыр': u'жактырчудай',
            u'туталан': u'туталанчудай',
            u'ремонтто': u'ремонтточудай',
            u'балкы': u'балкычудай',
            u'кылаала': u'кылаалачудай',
            u'бүрдө': u'бүрдөчүдөй',
            u'канык': u'каныкчудай',
            u'иске': u'искечүдөй',
            u'матыр': u'матырчудай',
            u'сызгыр': u'сызгырчудай',
            u'үрк': u'үркчүдөй',
            u'чий': u'чийчүдөй',
            u'мекирен': u'мекиренчүдөй',
            u'мелжи': u'мелжичүдөй',
            u'үн кат': u'үн катчудай',
            u'теренде': u'терендечүдөй',
            u'механизациялаш': u'механизациялашчудай',
            u'арна': u'арначудай',
            u'саргай': u'саргайчудай',
            u'эмде': u'эмдечүдөй',
            u'көкүт': u'көкүтчүдөй',
            u'чамда': u'чамдачудай',
            u'изде': u'издечүдөй',
            u'дүмүрөңдө': u'дүмүрөңдөчүдөй',
            u'кыркала': u'кыркалачудай',
            u'өл': u'өлчүдөй',
            u'көнөктө': u'көнөктөчүдөй',
            u'жукала': u'жукалачудай',
            u'бышып-жетил': u'бышып-жетилчүдөй',
            u'күңүрттө': u'күңүрттөчүдөй',
            u'жап': u'жапчудай',
            u'мөндүрлө': u'мөндүрлөчүдөй',
            u'чебелен': u'чебеленчүдөй',
            u'мунарыкта': u'мунарыктачудай',
            u'соз': u'созчудай',
            u'жүлжүй': u'жүлжүйчүдөй',
            u'түспөлдөн': u'түспөлдөнчүдөй',
        }
