from kg.lang.etish._ba import BaEtishMuchosu
from kg.lang.lang import KyrgyzWord
from kg.tests import KGTestCase


class EtishBaMuchoTest(KGTestCase):
    def test_1(self):
        data = self.get_data()

        for word, expected_form in data.items():
            affix = BaEtishMuchosu(KyrgyzWord(word))
            self.assertEqual(affix.make().word, expected_form)

    def get_data(self):
        return {
            'какылда': 'какылдаба',
            'бел ашыр': 'бел ашырба',
            'шылкый': 'шылкыйба',
            'кугур': 'кугурба',
            'күчүркө': 'күчүркөбө',
            'жабырт': 'жабыртпа',
            'улант': 'улантпа',
            'улгай': 'улгайба',
            'ура': 'ураба',
            'дарбы': 'дарбыба',
            'интернационалдаш': 'интернационалдашпа',
            'ыкта': 'ыктаба',
            'урун': 'урунба',
            'ылайла': 'ылайлаба',
            'чөлпүлдө': 'чөлпүлдөбө',
            'ардакта': 'ардактаба',
            'насыятта': 'насыяттаба',
            'уюмдаш': 'уюмдашпа',
            'майла': 'майлаба',
            'жайлоо': 'жайлообо',
            'жаркы': 'жаркыба',
            'жаркылда': 'жаркылдаба',
            'тегеректе': 'тегеректебе',
            'уял': 'уялба',
            'тоот': 'тоотпо',
            'бүрдө': 'бүрдөбө',
            'жакындаштыр': 'жакындаштырба',
            'сызгыр': 'сызгырба',
            'чыгымда': 'чыгымдаба',
            'кутказ': 'кутказба',
            'зарык': 'зарыкпа',
            'чымыра': 'чымыраба',
            'менменсин': 'менменсинбе',
            'сырай': 'сырайба',
            'механизациялаш': 'механизациялашпа',
            'дөңкүлдө': 'дөңкүлдөбө',
            'жугуз': 'жугузба',
            'эңсе': 'эңсебе',
            'тызылда': 'тызылдаба',
            'тымпый': 'тымпыйба',
            'эрбелеңде': 'эрбелеңдебе',
            'кайрат айт': 'кайрат айтпа',
            'такшал': 'такшалба',
            'тырмаңда': 'тырмаңдаба',
            'өжөрлөн': 'өжөрлөнбө',
            'аткарыл': 'аткарылба',
            'бил': 'билбе',
            'булгала': 'булгалаба',
            'күтүрө': 'күтүрөбө',
            'төңкө': 'төңкөбө',
        }
