
from kg.lang.bashka._dagy import DagyZatMuchosu
from kg.lang.lang import KyrgyzWord
from kg.tests import KGTestCase


class ZatDagyMuchoTest(KGTestCase):
    def test_1(self):
        data = self.get_data()

        for word, expected_form in data.items():
            affix = DagyZatMuchosu(KyrgyzWord(word))
            self.assertEqual(affix.make(), expected_form)

    def get_data(self):
        return {
            'негиздөөчү': 'негиздөөчүдөгү',
            'бушайман': 'бушаймандагы',
            'бадыран': 'бадырандагы',
            'эс-акыл': 'эс-акылдагы',
            'көпүрө': 'көпүрөдөгү',
            'качыр': 'качырдагы',
            'чоорчу': 'чоорчудагы',
            'коменданты': 'комендантыдагы',
            'тармал': 'тармалдагы',
            'тартыш': 'тартыштагы',
            'кап': 'каптагы',
            'новокаин': 'новокаиндеги',
            'жарк': 'жарктагы',
            'кут': 'куттагы',
            'амалкөйлүк': 'амалкөйлүктөгү',
            'айбан': 'айбандагы',
            'сүзмө': 'сүзмөдөгү',
            'көр': 'көрдөгү',
            'символика': 'символикадагы',
            'кызматчы': 'кызматчыдагы',
            'кесип': 'кесиптеги',
            'нускама': 'нускамадагы',
            'жоруш': 'жоруштагы',
            'энциклопедия': 'энциклопедиядагы',
            'цемент': 'цементтеги',
            'түп нуска': 'түп нускадагы',
            'гранит': 'граниттеги',
            'тообо': 'тоободогу',
            'үй': 'үйдөгү',
            'бажы': 'бажыдагы',
            'сака': 'сакадагы',
            'түтүк': 'түтүктөгү',
            'жубарымбек': 'жубарымбектеги',
            'сооп': 'сооптогу',
            'күнгөй': 'күнгөйдөгү',
            'олигарх': 'олигархтагы',
            'магистратура': 'магистратурадагы',
            'такай': 'такайдагы',
            'даярдоочу': 'даярдоочудагы',
            'марс': 'марстагы',
            'тамарка': 'тамаркадагы',
            'дем': 'демдеги',
            'кылмыш': 'кылмыштагы',
            'танапис': 'танапистеги',
            'том': 'томдогу',
            'жанр': 'жанрдагы',
            'адамгерчиликте': 'адамгерчиликтедеги',
            'доллар': 'доллардагы',
            'бактерия': 'бактериядагы',
        }
