from kg.lang.etish.chak import OtkonChak
from kg.lang.helps.attrs import *
from kg.lang.lang import KyrgyzWord
from kg.tests import KGTestCase


attrs_list = [men, sen, al, biz, siler, alar, siz, sizder]


class OtkonChakTest(KGTestCase):
    def test_1(self):
        data = self.get_data()

        for word, expected_forms in data.items():
            chak = OtkonChak(KyrgyzWord(word))
            for i in range(len(attrs_list)):
                attrs = attrs_list[i]
                self.assertEqual(chak.make(attrs.jak, attrs.jeke, attrs.sylyk), expected_forms[i])

    def get_data(self):
        return {
            'кий': [
                'кийдим', 'кийдиң', 'кийди',
                'кийдик', 'кийдиңер', 'кийишти',
                'кийдиңиз', 'кийдиңиздер'],

            'кара': [
                'карадым', 'карадың', 'карады',
                'карадык', 'карадыңар', 'карашты',
                'карадыңыз', 'карадыңыздар'],

            'тап': [
                'таптым', 'таптың', 'тапты',
                'таптык', 'таптыңар', 'табышты',
                'таптыңыз', 'таптыңыздар'],

            'ташы': [
                'ташыдым', 'ташыдың', 'ташыды',
                'ташыдык', 'ташыдыңар', 'ташышты',
                'ташыдыңыз', 'ташыдыңыздар'],

            'кыл': [
                'кылдым', 'кылдың', 'кылды',
                'кылдык', 'кылдыңар', 'кылышты',
                'кылдыңыз', 'кылдыңыздар'],

            'чой': [
                'чойдум', 'чойдуң', 'чойду',
                'чойдук', 'чойдуңар', 'чоюшту',
                'чойдуңуз', 'чойдуңуздар'],

            'ал': [
                'алдым', 'алдың', 'алды',
                'алдык', 'алдыңар', 'алышты',
                'алдыңыз', 'алдыңыздар'],

            'каз': [
                'каздым', 'каздың', 'казды',
                'каздык', 'каздыңар', 'казышты',
                'каздыңыз', 'каздыңыздар'],

            'сай': [
                'сайдым', 'сайдың', 'сайды',
                'сайдык', 'сайдыңар', 'сайышты',
                'сайдыңыз', 'сайдыңыздар'],

            'жаса': [
                'жасадым', 'жасадың', 'жасады',
                'жасадык', 'жасадыңар', 'жасашты',
                'жасадыңыз', 'жасадыңыздар'],

            'бар': [
                'бардым', 'бардың', 'барды',
                'бардык', 'бардыңар', 'барышты',
                'бардыңыз', 'бардыңыздар'],

            'теп': [
                'тептим', 'тептиң', 'тепти',
                'тептик', 'тептиңер', 'тебишти',
                'тептиңиз', 'тептиңиздер'],

            'ук': [
                'уктум', 'уктуң', 'укту',
                'уктук', 'уктуңар', 'угушту',
                'уктуңуз', 'уктуңуздар'],

            'ич': [
                'ичтим', 'ичтиң', 'ичти',
                'ичтик', 'ичтиңер', 'ичишти',
                'ичтиңиз', 'ичтиңиздер'],

            'токто': [
                'токтодум', 'токтодуң', 'токтоду',
                'токтодук', 'токтодуңар', 'токтошту',
                'токтодуңуз', 'токтодуңуздар'],
            'алай': [
                'алайдым', 'алайдың', 'алайды',
                'алайдык', 'алайдыңар', 'алайышты',
                'алайдыңыз', 'алайдыңыздар'],

            'куй': [
                'куйдум', 'куйдуң', 'куйду',
                'куйдук', 'куйдуңар', 'куюшту',
                'куйдуңуз', 'куйдуңуздар'],

            'бойтой': [
                'бойтойдум', 'бойтойдуң', 'бойтойду',
                'бойтойдук', 'бойтойдуңар', 'бойтоюшту',
                'бойтойдуңуз', 'бойтойдуңуздар'],

            'былчый': [
                'былчыйдым', 'былчыйдың', 'былчыйды',
                'былчыйдык', 'былчыйдыңар', 'былчыйышты',
                'былчыйдыңыз', 'былчыйдыңыздар'],

            'кеңей': [
                'кеңейдим', 'кеңейдиң', 'кеңейди',
                'кеңейдик', 'кеңейдиңер', 'кеңейишти',
                'кеңейдиңиз', 'кеңейдиңиздер'],

            'буруй': [
                'буруйдум', 'буруйдуң', 'буруйду',
                'буруйдук', 'буруйдуңар', 'буруюшту',
                'буруйдуңуз', 'буруйдуңуздар'],

            'ой': [
                'ойдум', 'ойдуң', 'ойду',
                'ойдук', 'ойдуңар', 'оюшту',
                'ойдуңуз', 'ойдуңуздар'],

            'акшый': [
                'акшыйдым', 'акшыйдың', 'акшыйды',
                'акшыйдык', 'акшыйдыңар', 'акшыйышты',
                'акшыйдыңыз', 'акшыйдыңыздар'],

        }
