from kg.lang.etish._gan import GanEtishMuchosu
from kg.lang.lang import KyrgyzWord
from kg.tests import KGTestCase


class EtishGanMuchoTest(KGTestCase):
    def test_1(self):
        data = self.get_data()

        for word, expected_form in data.items():
            affix = GanEtishMuchosu(KyrgyzWord(word))
            self.assertEqual(affix.make().word, expected_form)

    def get_data(self):
        return {
            'таңдан': 'таңданган',
            'сонурка': 'сонуркаган',
            'тап бер': 'тап берген',
            'тара': 'тараган',
            'тиште': 'тиштеген',
            'карга': 'каргаган',
            'уруш': 'урушкан',
            'конокто': 'коноктогон',
            'кандыр': 'кандырган',
            'аныкта': 'аныктаган',
            'жоопко ал': 'жоопко алган',
            'эңил': 'эңилген',
            'чачыра': 'чачыраган',
            'арыкта': 'арыктаган',
            'кой': 'койгон',
            'кылтыйт': 'кылтыйткан',
            'окшоңдо': 'окшоңдогон',
            'үшү': 'үшүгөн',
            'барсай': 'барсайган',
            'былчый': 'былчыйган',
            'дуулда': 'дуулдаган',
            'алмаштыр': 'алмаштырган',
            'бышкыр': 'бышкырган',
            'кырчын': 'кырчынган',
            'дүрдүк': 'дүрдүккөн',
            'жепирей': 'жепирейген',
            'кайында': 'кайындаган',
            'касам ич': 'касам ичкен',
            'ашык': 'ашыккан',
            'жүлжүй': 'жүлжүйгөн',
        }
