from kg.lang.etish._ba import BaEtishMuchosu
from kg.lang.etish._chu import ChuEtishMuchosu
from kg.lang.lang import KyrgyzWord
from kg.tests import KGTestCase


class EtishChuMuchoTest(KGTestCase):
    def test_1(self):
        data = self.get_data()

        for word, expected_form in data.items():
            affix = ChuEtishMuchosu(KyrgyzWord(word, False))
            self.assertEqual(affix.make(), expected_form)

    def get_data(self):
        return {
            'кийин': 'кийинчү',
            'күчүктө': 'күчүктөчү',
            'күчүркө': 'күчүркөчү',
            'жаңыла': 'жаңылачу',
            'чыңа': 'чыңачу',
            'кержей': 'кержейчү',
            'түнө': 'түнөчү',
            'чөбүрө': 'чөбүрөчү',
            'кон': 'кончу',
            'тезде': 'тездечү',
            'чуба': 'чубачу',
            'тат': 'татчу',
            'парала': 'паралачу',
            'жаркы': 'жаркычу',
            'кур': 'курчу',
            'таятала': 'таяталачу',
            'божомолдо': 'божомолдочу',
            'чүйрү': 'чүйрүчү',
            'үз': 'үзчү',
            'курсак ач': 'курсак аччу',
            'бүр': 'бүрчү',
            'жалоору': 'жалооручу',
            'жакшыр': 'жакшырчу',
            'баш бак': 'баш бакчу',
            'жалакайлан': 'жалакайланчу',
            'кезектеш': 'кезектешчү',
            'химиялаштыр': 'химиялаштырчу',
            'кууру': 'кууручу',
            'самтыра': 'самтырачу',
            'күт': 'күтчү',
            'тетирилен': 'тетириленчү',
            'чөктүр': 'чөктүрчү',
            'атан': 'атанчу',
            'бырылда': 'бырылдачу',
            'түптө': 'түптөчү',
            'көктө': 'көктөчү',
            'түр': 'түрчү',
            'зыңкый': 'зыңкыйчу',
            'чиймеле': 'чиймелечү',
            'такшал': 'такшалчу',
            'жумшакта': 'жумшактачу',
            'тыпыра': 'тыпырачу',
            'көңүлдөн': 'көңүлдөнчү',
            'чатакташ': 'чатакташчу',
            'ыңгайлаш': 'ыңгайлашчу',
            'жылжы': 'жылжычу',
            'күрсүлдө': 'күрсүлдөчү',
            'төмпөй': 'төмпөйчү',
            'сойло': 'сойлочу',
        }
