from kg.lang.etish._ba import BaEtishMuchosu
from kg.lang.etish._chu import ChuEtishMuchosu
from kg.lang.etish._chuday import ChudayEtishMuchosu
from kg.lang.lang import KyrgyzWord
from kg.tests import KGTestCase


class EtishChudayMuchoTest(KGTestCase):
    def test_1(self):
        data = self.get_data()

        for word, expected_form in data.items():
            affix = ChudayEtishMuchosu(KyrgyzWord(word))
            self.assertEqual(affix.make(), expected_form)

    def get_data(self):
        return {
            'апкаары': 'апкаарычудай',
            'мейманчыла': 'мейманчылачудай',
            'какыра': 'какырачудай',
            'укумда': 'укумдачудай',
            'баардаш': 'баардашчудай',
            'жокто': 'жокточудай',
            'жаңылыш': 'жаңылышчудай',
            'жадырап-жайна': 'жадырап-жайначудай',
            'боозу': 'боозучудай',
            'ур': 'урчудай',
            'токто': 'токточудай',
            'кыйкый': 'кыйкыйчудай',
            'алай': 'алайчудай',
            'жактыр': 'жактырчудай',
            'туталан': 'туталанчудай',
            'ремонтто': 'ремонтточудай',
            'балкы': 'балкычудай',
            'кылаала': 'кылаалачудай',
            'бүрдө': 'бүрдөчүдөй',
            'канык': 'каныкчудай',
            'иске': 'искечүдөй',
            'матыр': 'матырчудай',
            'сызгыр': 'сызгырчудай',
            'үрк': 'үркчүдөй',
            'чий': 'чийчүдөй',
            'мекирен': 'мекиренчүдөй',
            'мелжи': 'мелжичүдөй',
            'үн кат': 'үн катчудай',
            'теренде': 'терендечүдөй',
            'механизациялаш': 'механизациялашчудай',
            'арна': 'арначудай',
            'саргай': 'саргайчудай',
            'эмде': 'эмдечүдөй',
            'көкүт': 'көкүтчүдөй',
            'чамда': 'чамдачудай',
            'изде': 'издечүдөй',
            'дүмүрөңдө': 'дүмүрөңдөчүдөй',
            'кыркала': 'кыркалачудай',
            'өл': 'өлчүдөй',
            'көнөктө': 'көнөктөчүдөй',
            'жукала': 'жукалачудай',
            'бышып-жетил': 'бышып-жетилчүдөй',
            'күңүрттө': 'күңүрттөчүдөй',
            'жап': 'жапчудай',
            'мөндүрлө': 'мөндүрлөчүдөй',
            'чебелен': 'чебеленчүдөй',
            'мунарыкта': 'мунарыктачудай',
            'соз': 'созчудай',
            'жүлжүй': 'жүлжүйчүдөй',
            'түспөлдөн': 'түспөлдөнчүдөй',
        }
