from kg.lang.lang import KyrgyzWord
from kg.lang.syn._syz import SyzZatMuchosu
from kg.tests import KGTestCase


class ZatSyzMuchoTest(KGTestCase):
    def test_1(self):
        data = self.get_data()

        for word, expected_form in data.items():
            affix = SyzZatMuchosu(KyrgyzWord(word))
            self.assertEqual(affix.make(), expected_form)

    def get_data(self):
        return {
            'ноябрь': 'ноябрсыз',
            'семинар': 'семинарсыз',
            'толуктооч': 'толуктоочсуз',
            'куррикулум': 'куррикулумсуз',
            'калп': 'калпсыз',
            'алпкаракуш': 'алпкаракушсуз',
            'чок': 'чоксуз',
            'керек': 'керексиз',
            'номер': 'номерсиз',
            'өмүрзар': 'өмүрзарсыз',
            'зарылчылык': 'зарылчылыксыз',
            'айдоочу': 'айдоочусуз',
            'диабет': 'диабетсиз',
            'конфедерация': 'конфедерациясыз',
            'зоолог': 'зоологсуз',
            'жөлөк': 'жөлөксүз',
            'чаарчык': 'чаарчыксыз',
            'диагнос': 'диагноссуз',
            'жүк': 'жүксүз',
            'келте': 'келтесиз',
            'абийир': 'абийирсиз',
            'код': 'кодсуз',
            'айыл-апа': 'айыл-апасыз',
            'козголоң': 'козголоңсуз',
            'табит': 'табитсиз',
            'вектор': 'векторсуз',
            'табуучу': 'табуучусуз',
            'фармацевт': 'фармацевтсиз',
            'авиабомбалоо': 'авиабомбалоосуз',
            'даткайым': 'даткайымсыз',
            'ымала': 'ымаласыз',
            'пакене': 'пакенесиз',
            'пальто': 'пальтосуз',
            'убакыт': 'убакытсыз',
            'жеңил өнөр жай': 'жеңил өнөр жайсыз',
            'түндүк': 'түндүксүз',
            'буддист': 'буддистсиз',
            'басма': 'басмасыз',
            'керектөөчүлүк': 'керектөөчүлүксүз',
            'ранг': 'рангсыз',
            'ордер': 'ордерсиз',
            'тамак-аш': 'тамак-ашсыз',
            'жесир': 'жесирсиз',
            'паста': 'пастасыз',
            'кошомат': 'кошоматсыз',
            'түшүнүк кат': 'түшүнүк катсыз',
            'кара кулак шер': 'кара кулак шерсиз',
            'таңсык': 'таңсыксыз',
            'сур эчки': 'сур эчкисиз',
            'нерсе': 'нерсесиз',
        }
