from kg.lang.lang import KyrgyzWord
from kg.lang.syn._dai import DaiZatMuchosu
from kg.tests import KGTestCase


class ZatDaiMuchoTest(KGTestCase):
    def test_1(self):
        data = self.get_data()

        for word, expected_form in data.items():
            affix = DaiZatMuchosu(KyrgyzWord(word))
            self.assertEqual(affix.make(), expected_form)

    def get_data(self):
        return {
            'көзөмөлдүк': 'көзөмөлдүктөй',
            'пианино': 'пианинодой',
            'героин': 'героиндей',
            'дулдул': 'дулдулдай',
            'чил': 'чилдей',
            'пицца': 'пиццадай',
            'каңгыр-куңгур': 'каңгыр-куңгурдай',
            'предмет': 'предметтей',
            'айбанат': 'айбанаттай',
            'катыш': 'катыштай',
            'терек': 'теректей',
            'запчасть': 'запчасттай',
            'маселе': 'маселедей',
            'үп': 'үптөй',
            'жасоол': 'жасоолдой',
            'кек': 'кектей',
            'нускоочу': 'нускоочудай',
            'баёолук': 'баёолуктай',
            'кара курт': 'кара курттай',
            'оорукана': 'ооруканадай',
            'информатика': 'информатикадай',
            'сай': 'сайдай',
            'жож': 'жождой',
            'лөлү': 'лөлүдөй',
            'айыл-апа': 'айыл-ападай',
            'гүлгүн': 'гүлгүндөй',
            'матрос': 'матростой',
            'табуучу': 'табуучудай',
            'маалымдама': 'маалымдамадай',
            'зыяпат': 'зыяпаттай',
            'сыйкырчы': 'сыйкырчыдай',
            'диктор': 'диктордой',
            'диктофон': 'диктофондой',
            'каңырык': 'каңырыктай',
            'пордукция': 'пордукциядай',
            'асылзаада': 'асылзаададай',
            'айгай': 'айгайдай',
            'каркыра': 'каркырадай',
            'шейит': 'шейиттей',
            'жер-жебер': 'жер-жебердей',
            'барабан': 'барабандай',
            'аксанатай': 'аксанатайдай',
            'гамма': 'гаммадай',
            'дарс': 'дарстай',
            'арена': 'аренадай',
            'барча': 'барчадай',
            'жетекчи': 'жетекчидей',
            'тулуп': 'тулуптай',
            'жаңжал': 'жаңжалдай',
            'тапанча': 'тапанчадай',
        }
