from kg.lang.etish._bash import BashEtishMuchosu
from kg.lang.lang import KyrgyzWord
from kg.tests import KGTestCase


class EtishBashMuchoTest(KGTestCase):
    def test_1(self):
        data = self.get_data()

        for word, expected_form in data.items():
            affix = BashEtishMuchosu(KyrgyzWord(word))
            self.assertEqual(affix.make(), expected_form)

    def get_data(self):
        return {
            'сүйүн': 'сүйүнбөш',
            'өлчө': 'өлчөбөш',
            'куйтулан': 'куйтуланбаш',
            'легалдаш': 'легалдашпаш',
            'ызырын': 'ызырынбаш',
            'утул': 'утулбаш',
            'колтукташ': 'колтукташпаш',
            'жылаңаякта': 'жылаңаяктабаш',
            'магдыра': 'магдырабаш',
            'жылбыш': 'жылбышпаш',
            'тартыш': 'тартышпаш',
            'ылдамда': 'ылдамдабаш',
            'чымыра': 'чымырабаш',
            'суу': 'суубаш',
            'кур': 'курбаш',
            'ичир': 'ичирбеш',
            'кир': 'кирбеш',
            'жайыл': 'жайылбаш',
            'үксүй': 'үксүйбөш',
            'ныкта': 'ныктабаш',
            'ыргышта': 'ыргыштабаш',
            'сабырка': 'сабыркабаш',
            'үлгүр': 'үлгүрбөш',
            'ысыла': 'ысылабаш',
            'жакындаш': 'жакындашпаш',
            'ышта': 'ыштабаш',
            'бажыра': 'бажырабаш',
            'кутул': 'кутулбаш',
            'кымырын': 'кымырынбаш',
            'кынжый': 'кынжыйбаш',
            'түрлөн': 'түрлөнбөш',
            'тайгалан': 'тайгаланбаш',
            'зөөкүрлөн': 'зөөкүрлөнбөш',
            'кылтый': 'кылтыйбаш',
            'тыкылда': 'тыкылдабаш',
            'коомайсыздан': 'коомайсызданбаш',
            'кийри': 'кийрибеш',
            'такшал': 'такшалбаш',
            'көңүлдөн': 'көңүлдөнбөш',
            'шиле': 'шилебеш',
            'карттан': 'карттанбаш',
            'ийик': 'ийикпеш',
            'ийинде': 'ийиндебеш',
            'мөңкү': 'мөңкүбөш',
            'талык': 'талыкпаш',
            'өркүндө': 'өркүндөбөш',
            'жойло': 'жойлобош',
            'пулда': 'пулдабаш',
            'жет': 'жетпеш',
            'баш катыр': 'баш катырбаш',
        }
