# coding=utf-8
from kg_lang.kyrgyz.etish.chak import KelerChak
from kg_lang.kyrgyz.helps.attrs import *
from kg_lang.kyrgyz.lang import KyrgyzWord
from kg_lang.tests import KGTestCase


attrs_list = [men, sen, al, biz, siler, alar, siz, sizder]


class KelerChakTest(KGTestCase):
    def test_1(self):

        data = self.get_data()

        for word, expected_forms in data.items():
            chak = KelerChak(KyrgyzWord(word))
            for i in range(len(attrs_list)):
                attrs = attrs_list[i]
                self.assertEqual(chak.make(attrs.jak, attrs.jeke, attrs.sylyk), expected_forms[i])

    def get_data(self):
        return {
            u'кара': [
                u'карайм', u'карайсың', u'карайт',
                u'карайбыз', u'карайсыңар', u'карашат',
                u'карайсыз', u'карайсыздар'],

            u'сай': [
                u'саям', u'саясың', u'саят',
                u'саябыз', u'саясыңар', u'сайышат',
                u'саясыз', u'саясыздар'],

            u'ташы': [
                u'ташыйм', u'ташыйсың', u'ташыйт',
                u'ташыйбыз', u'ташыйсыңар', u'ташышат',
                u'ташыйсыз', u'ташыйсыздар'],

            u'ук': [
                u'угам', u'угасың', u'угат',
                u'угабыз', u'угасыңар', u'угушат',
                u'угасыз', u'угасыздар'],

            u'чой': [
                u'чоём', u'чоёсуң', u'чоёт',
                u'чоёбуз', u'чоёсуңар', u'чоюшат',
                u'чоёсуз', u'чоёсуздар'],

            u'ал': [
                u'алам', u'аласың', u'алат',
                u'алабыз', u'аласыңар', u'алышат',
                u'аласыз', u'аласыздар'],

            u'бар': [
                u'барам', u'барасың', u'барат',
                u'барабыз', u'барасыңар', u'барышат',
                u'барасыз', u'барасыздар'],

            u'жаса': [
                u'жасайм', u'жасайсың', u'жасайт',
                u'жасайбыз', u'жасайсыңар', u'жасашат',
                u'жасайсыз', u'жасайсыздар'],

            u'ич': [
                u'ичем', u'ичесиң', u'ичет',
                u'ичебиз', u'ичесиңер', u'ичишет',
                u'ичесиз', u'ичесиздер'],

            u'каз': [
                u'казам', u'казасың', u'казат',
                u'казабыз', u'казасыңар', u'казышат',
                u'казасыз', u'казасыздар'],

            u'кий': [
                u'кием', u'киесиң', u'киет',
                u'киебиз', u'киесиңер', u'кийишет',
                u'киесиз', u'киесиздер'],

            u'кичирей': [
                u'кичиреем', u'кичиреесиң', u'кичиреет',
                u'кичиреебиз', u'кичиреесиңер', u'кичирейишет',
                u'кичиреесиз', u'кичиреесиздер'],

            u'кыл': [
                u'кылам', u'кыласың', u'кылат',
                u'кылабыз', u'кыласыңар', u'кылышат',
                u'кыласыз', u'кыласыздар'],

            u'тап': [
                u'табам', u'табасың', u'табат',
                u'табабыз', u'табасыңар', u'табышат',
                u'табасыз', u'табасыздар'],

            u'теп': [
                u'тебем', u'тебесиң', u'тебет',
                u'тебебиз', u'тебесиңер', u'тебишет',
                u'тебесиз', u'тебесиздер'],

            u'токто': [
                u'токтойм', u'токтойсуң', u'токтойт',
                u'токтойбуз', u'токтойсуңар', u'токтошот',
                u'токтойсуз', u'токтойсуздар'],

            u'алай': [
                u'алаям', u'алаясың', u'алаят',
                u'алаябыз', u'алаясыңар', u'алайышат',
                u'алаясыз', u'алаясыздар'],

            u'куй': [
                u'куям', u'куясың', u'куят',
                u'куябыз', u'куясыңар', u'куюшат',
                u'куясыз', u'куясыздар'],

            u'бойтой': [
                u'бойтоём', u'бойтоёсуң', u'бойтоёт',
                u'бойтоёбуз', u'бойтоёсуңар', u'бойтоюшат',
                u'бойтоёсуз', u'бойтоёсуздар'],

            u'былчый': [
                u'былчыям', u'былчыясың', u'былчыят',
                u'былчыябыз', u'былчыясыңар', u'былчыйышат',
                u'былчыясыз', u'былчыясыздар'],

            u'кеңей': [
                u'кеңеем', u'кеңеесиң', u'кеңеет',
                u'кеңеебиз', u'кеңеесиңер', u'кеңейишет',
                u'кеңеесиз', u'кеңеесиздер'],

            u'буруй': [
                u'буруям', u'буруясың', u'буруят',
                u'буруябыз', u'буруясыңар', u'буруюшат',
                u'буруясыз', u'буруясыздар'],

            u'ой': [
                u'оём', u'оёсуң', u'оёт',
                u'оёбуз', u'оёсуңар', u'оюшат',
                u'оёсуз', u'оёсуздар'],

            u'акшый': [
                u'акшыям', u'акшыясың', u'акшыят',
                u'акшыябыз', u'акшыясыңар', u'акшыйышат',
                u'акшыясыз', u'акшыясыздар'],

        }
