# coding=utf-8
from kg_lang.kyrgyz.etish.chak import UchurChak
from kg_lang.kyrgyz.helps.attrs import *
from kg_lang.kyrgyz.lang import KyrgyzWord
from kg_lang.tests import KGTestCase


attrs_list = [men, sen, al, biz, siler, alar, siz, sizder]


class UchurChakTest(KGTestCase):
    def test_1(self):
        data = self.get_data()

        for word, forms in data.items():
            chak = UchurChak(KyrgyzWord(word))
            for i in range(len(attrs_list)):
                attrs = attrs_list[i]
                self.assertEqual(chak.make(attrs.jak, attrs.jeke, attrs.sylyk), forms[i])

    def get_data(self):
        return {
            u'кыл': [
                u'кылып жатам', u'кылып жатасың', u'кылып жатат',
                u'кылып жатабыз', u'кылып жатасыңар', u'кылып жатышат',
                u'кылып жатасыз', u'кылып жатасыздар'],

            u'тап': [
                u'таап жатам', u'таап жатасың', u'таап жатат',
                u'таап жатабыз', u'таап жатасыңар', u'таап жатышат',
                u'таап жатасыз', u'таап жатасыздар'],

            u'жаса': [
                u'жасап жатам', u'жасап жатасың', u'жасап жатат',
                u'жасап жатабыз', u'жасап жатасыңар', u'жасап жатышат',
                u'жасап жатасыз', u'жасап жатасыздар'],

            u'ташы': [
                u'ташып жатам', u'ташып жатасың', u'ташып жатат',
                u'ташып жатабыз', u'ташып жатасыңар', u'ташып жатышат',
                u'ташып жатасыз', u'ташып жатасыздар'],

            u'ук': [
                u'угуп жатам', u'угуп жатасың', u'угуп жатат',
                u'угуп жатабыз', u'угуп жатасыңар', u'угуп жатышат',
                u'угуп жатасыз', u'угуп жатасыздар'],

            u'чой': [
                u'чоюп жатам', u'чоюп жатасың', u'чоюп жатат',
                u'чоюп жатабыз', u'чоюп жатасыңар', u'чоюп жатышат',
                u'чоюп жатасыз', u'чоюп жатасыздар'],

            u'ал': [
                u'алып жатам', u'алып жатасың', u'алып жатат',
                u'алып жатабыз', u'алып жатасыңар', u'алып жатышат',
                u'алып жатасыз', u'алып жатасыздар'],

            u'бар': [
                u'барып жатам', u'барып жатасың', u'барып жатат',
                u'барып жатабыз', u'барып жатасыңар', u'барып жатышат',
                u'барып жатасыз', u'барып жатасыздар'],

            u'ич': [
                u'ичип жатам', u'ичип жатасың', u'ичип жатат',
                u'ичип жатабыз', u'ичип жатасыңар', u'ичип жатышат',
                u'ичип жатасыз', u'ичип жатасыздар'],

            u'каз': [
                u'казып жатам', u'казып жатасың', u'казып жатат',
                u'казып жатабыз', u'казып жатасыңар', u'казып жатышат',
                u'казып жатасыз', u'казып жатасыздар'],

            u'кара': [
                u'карап жатам', u'карап жатасың', u'карап жатат',
                u'карап жатабыз', u'карап жатасыңар', u'карап жатышат',
                u'карап жатасыз', u'карап жатасыздар'],

            u'кий': [
                u'кийип жатам', u'кийип жатасың', u'кийип жатат',
                u'кийип жатабыз', u'кийип жатасыңар', u'кийип жатышат',
                u'кийип жатасыз', u'кийип жатасыздар'],

            u'сай': [
                u'сайып жатам', u'сайып жатасың', u'сайып жатат',
                u'сайып жатабыз', u'сайып жатасыңар', u'сайып жатышат',
                u'сайып жатасыз', u'сайып жатасыздар'],

            u'теп': [
                u'тээп жатам', u'тээп жатасың', u'тээп жатат',
                u'тээп жатабыз', u'тээп жатасыңар', u'тээп жатышат',
                u'тээп жатасыз', u'тээп жатасыздар'],

            u'токто': [
                u'токтоп жатам', u'токтоп жатасың', u'токтоп жатат',
                u'токтоп жатабыз', u'токтоп жатасыңар', u'токтоп жатышат',
                u'токтоп жатасыз', u'токтоп жатасыздар'],
            u'алай': [
                u'алайып жатам', u'алайып жатасың', u'алайып жатат',
                u'алайып жатабыз', u'алайып жатасыңар', u'алайып жатышат',
                u'алайып жатасыз', u'алайып жатасыздар'],

            u'куй': [
                u'куюп жатам', u'куюп жатасың', u'куюп жатат',
                u'куюп жатабыз', u'куюп жатасыңар', u'куюп жатышат',
                u'куюп жатасыз', u'куюп жатасыздар'],

            u'бойтой': [
                u'бойтоюп жатам', u'бойтоюп жатасың', u'бойтоюп жатат',
                u'бойтоюп жатабыз', u'бойтоюп жатасыңар', u'бойтоюп жатышат',
                u'бойтоюп жатасыз', u'бойтоюп жатасыздар'],

            u'былчый': [
                u'былчыйып жатам', u'былчыйып жатасың', u'былчыйып жатат',
                u'былчыйып жатабыз', u'былчыйып жатасыңар', u'былчыйып жатышат',
                u'былчыйып жатасыз', u'былчыйып жатасыздар'],

            u'кеңей': [
                u'кеңейип жатам', u'кеңейип жатасың', u'кеңейип жатат',
                u'кеңейип жатабыз', u'кеңейип жатасыңар', u'кеңейип жатышат',
                u'кеңейип жатасыз', u'кеңейип жатасыздар'],

            u'буруй': [
                u'буруюп жатам', u'буруюп жатасың', u'буруюп жатат',
                u'буруюп жатабыз', u'буруюп жатасыңар', u'буруюп жатышат',
                u'буруюп жатасыз', u'буруюп жатасыздар'],

            u'ой': [
                u'оюп жатам', u'оюп жатасың', u'оюп жатат',
                u'оюп жатабыз', u'оюп жатасыңар', u'оюп жатышат',
                u'оюп жатасыз', u'оюп жатасыздар'],

            u'акшый': [
                u'акшыйып жатам', u'акшыйып жатасың', u'акшыйып жатат',
                u'акшыйып жатабыз', u'акшыйып жатасыңар', u'акшыйып жатышат',
                u'акшыйып жатасыз', u'акшыйып жатасыздар'],

            u'төмпөй': [
                u'төмпөйүп жатам', u'төмпөйүп жатасың', u'төмпөйүп жатат',
                u'төмпөйүп жатабыз', u'төмпөйүп жатасыңар', u'төмпөйүп жатышат',
                u'төмпөйүп жатасыз', u'төмпөйүп жатасыздар'],

        }
