# coding=utf-8
from kg_lang.kyrgyz.etish._ba import BaEtishMuchosu
from kg_lang.kyrgyz.lang import KyrgyzWord
from kg_lang.tests import KGTestCase


class EtishBaMuchoTest(KGTestCase):
    def test_1(self):
        data = self.get_data()

        for word, expected_form in data.items():
            affix = BaEtishMuchosu(KyrgyzWord(word))
            self.assertEqual(affix.make().word, expected_form)

    def get_data(self):
        return {
            u'какылда': u'какылдаба',
            u'бел ашыр': u'бел ашырба',
            u'шылкый': u'шылкыйба',
            u'кугур': u'кугурба',
            u'күчүркө': u'күчүркөбө',
            u'жабырт': u'жабыртпа',
            u'улант': u'улантпа',
            u'улгай': u'улгайба',
            u'ура': u'ураба',
            u'дарбы': u'дарбыба',
            u'интернационалдаш': u'интернационалдашпа',
            u'ыкта': u'ыктаба',
            u'урун': u'урунба',
            u'ылайла': u'ылайлаба',
            u'чөлпүлдө': u'чөлпүлдөбө',
            u'ардакта': u'ардактаба',
            u'насыятта': u'насыяттаба',
            u'уюмдаш': u'уюмдашпа',
            u'майла': u'майлаба',
            u'жайлоо': u'жайлообо',
            u'жаркы': u'жаркыба',
            u'жаркылда': u'жаркылдаба',
            u'тегеректе': u'тегеректебе',
            u'уял': u'уялба',
            u'тоот': u'тоотпо',
            u'бүрдө': u'бүрдөбө',
            u'жакындаштыр': u'жакындаштырба',
            u'сызгыр': u'сызгырба',
            u'чыгымда': u'чыгымдаба',
            u'кутказ': u'кутказба',
            u'зарык': u'зарыкпа',
            u'чымыра': u'чымыраба',
            u'менменсин': u'менменсинбе',
            u'сырай': u'сырайба',
            u'механизациялаш': u'механизациялашпа',
            u'дөңкүлдө': u'дөңкүлдөбө',
            u'жугуз': u'жугузба',
            u'эңсе': u'эңсебе',
            u'тызылда': u'тызылдаба',
            u'тымпый': u'тымпыйба',
            u'эрбелеңде': u'эрбелеңдебе',
            u'кайрат айт': u'кайрат айтпа',
            u'такшал': u'такшалба',
            u'тырмаңда': u'тырмаңдаба',
            u'өжөрлөн': u'өжөрлөнбө',
            u'аткарыл': u'аткарылба',
            u'бил': u'билбе',
            u'булгала': u'булгалаба',
            u'күтүрө': u'күтүрөбө',
            u'төңкө': u'төңкөбө',
        }
