# coding=utf-8
from kg_lang.kyrgyz.etish.chak import OtkonChak
from kg_lang.kyrgyz.helps.attrs import *
from kg_lang.kyrgyz.lang import KyrgyzWord
from kg_lang.tests import KGTestCase


attrs_list = [men, sen, al, biz, siler, alar, siz, sizder]


class OtkonChakTest(KGTestCase):
    def test_1(self):
        data = self.get_data()

        for word, expected_forms in data.items():
            chak = OtkonChak(KyrgyzWord(word))
            for i in range(len(attrs_list)):
                attrs = attrs_list[i]
                self.assertEqual(chak.make(attrs.jak, attrs.jeke, attrs.sylyk), expected_forms[i])

    def get_data(self):
        return {
            u'кий': [
                u'кийдим', u'кийдиң', u'кийди',
                u'кийдик', u'кийдиңер', u'кийишти',
                u'кийдиңиз', u'кийдиңиздер'],

            u'кара': [
                u'карадым', u'карадың', u'карады',
                u'карадык', u'карадыңар', u'карашты',
                u'карадыңыз', u'карадыңыздар'],

            u'тап': [
                u'таптым', u'таптың', u'тапты',
                u'таптык', u'таптыңар', u'табышты',
                u'таптыңыз', u'таптыңыздар'],

            u'ташы': [
                u'ташыдым', u'ташыдың', u'ташыды',
                u'ташыдык', u'ташыдыңар', u'ташышты',
                u'ташыдыңыз', u'ташыдыңыздар'],

            u'кыл': [
                u'кылдым', u'кылдың', u'кылды',
                u'кылдык', u'кылдыңар', u'кылышты',
                u'кылдыңыз', u'кылдыңыздар'],

            u'чой': [
                u'чойдум', u'чойдуң', u'чойду',
                u'чойдук', u'чойдуңар', u'чоюшту',
                u'чойдуңуз', u'чойдуңуздар'],

            u'ал': [
                u'алдым', u'алдың', u'алды',
                u'алдык', u'алдыңар', u'алышты',
                u'алдыңыз', u'алдыңыздар'],

            u'каз': [
                u'каздым', u'каздың', u'казды',
                u'каздык', u'каздыңар', u'казышты',
                u'каздыңыз', u'каздыңыздар'],

            u'сай': [
                u'сайдым', u'сайдың', u'сайды',
                u'сайдык', u'сайдыңар', u'сайышты',
                u'сайдыңыз', u'сайдыңыздар'],

            u'жаса': [
                u'жасадым', u'жасадың', u'жасады',
                u'жасадык', u'жасадыңар', u'жасашты',
                u'жасадыңыз', u'жасадыңыздар'],

            u'бар': [
                u'бардым', u'бардың', u'барды',
                u'бардык', u'бардыңар', u'барышты',
                u'бардыңыз', u'бардыңыздар'],

            u'теп': [
                u'тептим', u'тептиң', u'тепти',
                u'тептик', u'тептиңер', u'тебишти',
                u'тептиңиз', u'тептиңиздер'],

            u'ук': [
                u'уктум', u'уктуң', u'укту',
                u'уктук', u'уктуңар', u'угушту',
                u'уктуңуз', u'уктуңуздар'],

            u'ич': [
                u'ичтим', u'ичтиң', u'ичти',
                u'ичтик', u'ичтиңер', u'ичишти',
                u'ичтиңиз', u'ичтиңиздер'],

            u'токто': [
                u'токтодум', u'токтодуң', u'токтоду',
                u'токтодук', u'токтодуңар', u'токтошту',
                u'токтодуңуз', u'токтодуңуздар'],
            u'алай': [
                u'алайдым', u'алайдың', u'алайды',
                u'алайдык', u'алайдыңар', u'алайышты',
                u'алайдыңыз', u'алайдыңыздар'],

            u'куй': [
                u'куйдум', u'куйдуң', u'куйду',
                u'куйдук', u'куйдуңар', u'куюшту',
                u'куйдуңуз', u'куйдуңуздар'],

            u'бойтой': [
                u'бойтойдум', u'бойтойдуң', u'бойтойду',
                u'бойтойдук', u'бойтойдуңар', u'бойтоюшту',
                u'бойтойдуңуз', u'бойтойдуңуздар'],

            u'былчый': [
                u'былчыйдым', u'былчыйдың', u'былчыйды',
                u'былчыйдык', u'былчыйдыңар', u'былчыйышты',
                u'былчыйдыңыз', u'былчыйдыңыздар'],

            u'кеңей': [
                u'кеңейдим', u'кеңейдиң', u'кеңейди',
                u'кеңейдик', u'кеңейдиңер', u'кеңейишти',
                u'кеңейдиңиз', u'кеңейдиңиздер'],

            u'буруй': [
                u'буруйдум', u'буруйдуң', u'буруйду',
                u'буруйдук', u'буруйдуңар', u'буруюшту',
                u'буруйдуңуз', u'буруйдуңуздар'],

            u'ой': [
                u'ойдум', u'ойдуң', u'ойду',
                u'ойдук', u'ойдуңар', u'оюшту',
                u'ойдуңуз', u'ойдуңуздар'],

            u'акшый': [
                u'акшыйдым', u'акшыйдың', u'акшыйды',
                u'акшыйдык', u'акшыйдыңар', u'акшыйышты',
                u'акшыйдыңыз', u'акшыйдыңыздар'],

        }
